<html>
    <header>
        <title>Мое домашнее задание по лекции 3.1 "Классы и объекты"</title>
    </header>
    <body>
        <h1>Мое домашнее задание по лекции 3.1 "Классы и объекты"</h1>
            <h2>Мое понимание инкапсуляции</h2>
                <p></p>
            <h2>В чем плюсы и минусы объектов</h2>
                <p></p>
            <h2>Описание 5 классов:</h2>
                <ul>
                    <li> со свойствами и методами</li>
                    <li>по 2 объекта каждого</li>
                </ul>
                <ol>
                    <li>Машина</li>
                    <li>Телевизор</li>
                    <li>Шариковая ручка</li>
                    <li>Утка</li>
                    <li>Товар</li>
                </ol>
                <a href="example.php" target="_blank">Открыть пример в новом окне</a>
                <a href="" target="_blank">Открыть пример в новом окне</a>
    </body>
</html>
Распишите своё понимание инкапсуляции. Представьте, что вас спрашивают на собеседовании.
Сформулируйте своими словами в чём плюсы объектов, а в чём минусы?
Опишите 5 классов и создайте по 2 объекта каждого класса — Машина, Телевизор, Шариковая ручка, Утка, Товар. Классы должны содержать свойства и методы. Все в одном файле.
